<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Note" data-toc-modified-id="Note-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Note</a></span></li><li><span><a href="#Load-data-and-packages" data-toc-modified-id="Load-data-and-packages-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Load data and packages</a></span><ul class="toc-item"><li><span><a href="#Choose-tech-stocks-as-the-focus" data-toc-modified-id="Choose-tech-stocks-as-the-focus-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Choose tech stocks as the focus</a></span></li></ul></li><li><span><a href="#Pivot-dataframe,-so-that-each-stock-is-a-column" data-toc-modified-id="Pivot-dataframe,-so-that-each-stock-is-a-column-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pivot dataframe, so that each stock is a column</a></span></li><li><span><a href="#Prepare-data-for-analysis" data-toc-modified-id="Prepare-data-for-analysis-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Prepare data for analysis</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Use-.shift()-to-quickly-change-the-index-to-leave-the-first-few-rows-blank" data-toc-modified-id="Use-.shift()-to-quickly-change-the-index-to-leave-the-first-few-rows-blank-4.0.1"><span class="toc-item-num">4.0.1&nbsp;&nbsp;</span>Use <code>.shift()</code> to quickly change the index to leave the first few rows blank</a></span></li><li><span><a href="#Calculate-returns-over-7-days-prior-as-{-prices_today/prices_7_days_ago--1.0-}" data-toc-modified-id="Calculate-returns-over-7-days-prior-as-{-prices_today/prices_7_days_ago--1.0-}-4.0.2"><span class="toc-item-num">4.0.2&nbsp;&nbsp;</span>Calculate returns over 7 days prior as { prices_today/prices_7_days_ago -1.0 }</a></span></li><li><span><a href="#Melt-(unpivot)-data-to-create-an-analytical-base-table-(ABT)" data-toc-modified-id="Melt-(unpivot)-data-to-create-an-analytical-base-table-(ABT)-4.0.3"><span class="toc-item-num">4.0.3&nbsp;&nbsp;</span>Melt (unpivot) data to create an analytical base table (ABT)</a></span></li><li><span><a href="#Repeat-the-shifting-and-calculation-for-the-14,-21,-28-day-offset" data-toc-modified-id="Repeat-the-shifting-and-calculation-for-the-14,-21,-28-day-offset-4.0.4"><span class="toc-item-num">4.0.4&nbsp;&nbsp;</span>Repeat the shifting and calculation for the 14, 21, 28-day offset</a></span></li><li><span><a href="#Repeat-the-melting-process-for-all-other-time-offsets" data-toc-modified-id="Repeat-the-melting-process-for-all-other-time-offsets-4.0.5"><span class="toc-item-num">4.0.5&nbsp;&nbsp;</span>Repeat the melting process for all other time offsets</a></span></li><li><span><a href="#Create-a-seperate-set-for-7-day-forward-offset" data-toc-modified-id="Create-a-seperate-set-for-7-day-forward-offset-4.0.6"><span class="toc-item-num">4.0.6&nbsp;&nbsp;</span>Create a seperate set for 7-day-forward offset</a></span></li><li><span><a href="#Use-reduce()-to-merge-all-dataframes-(representing-intervals)-in-the-dict-into-one-single-ABT" data-toc-modified-id="Use-reduce()-to-merge-all-dataframes-(representing-intervals)-in-the-dict-into-one-single-ABT-4.0.7"><span class="toc-item-num">4.0.7&nbsp;&nbsp;</span>Use <code>reduce()</code> to merge all dataframes (representing intervals) in the dict into one single ABT</a></span></li></ul></li></ul></li></ul></div>

# Note
Done in collaboration with Davis Trinh on my team.

# Load data and packages

In [48]:
import pandas as pd

In [49]:
# display floats with 2 decimal places so, that it is easier to see the prices
pd.options.display.float_format = '{:,.2f}'.format

In [50]:
df = pd.read_csv('all_stocks_2017-2018.csv',
                names=['Date', 'Open', 'High', 'Low', 'Close', 'Volume','Name']).reset_index().drop(0)

In [51]:
# Use head() to look at the first few rows
df.head()

   index      Date    Open    High     Low   Close   Volume Name
1      1  1/3/2017  178.83     180  177.22  178.05  2510055  MMM
2      2  1/4/2017  178.03   178.9  177.61  178.32  1541985  MMM
3      3  1/5/2017  178.26  179.14  176.89  177.71  1447848  MMM
4      4  1/6/2017  177.29   178.6   175.8  178.23  1625049  MMM
5      5  1/9/2017  178.37  178.38   177.2  177.27  1622625  MMM

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7781 entries, 1 to 7781
Data columns (total 8 columns):
index     7781 non-null int64
Date      7781 non-null object
Open      7757 non-null object
High      7772 non-null object
Low       7762 non-null object
Close     7781 non-null object
Volume    7781 non-null object
Name      7781 non-null object
dtypes: int64(1), object(7)
memory usage: 334.3+ KB

Open, High, Low, Close, and Volume are numeric. The `object` dtype suggests there are a mix of dtypes in these columns. 
We need to cast these columns as float.

In [53]:
for i in ['Open', 'High', 'Low', 'Close', 'Volume']:
    df.loc[:,i] = df.loc[:,i].astype('float')

## Choose tech stocks as the focus

In [54]:
print( df.Name.unique())

['MMM' 'AXP' 'AAPL' 'BA' 'CAT' 'CVX' 'CSCO' 'KO' 'DIS' 'XOM' 'GE' 'GS'
 'HD' 'IBM' 'INTC' 'JNJ' 'JPM' 'MCD' 'MRK' 'MSFT' 'NKE' 'PFE' 'PG' 'TRV'
 'UTX' 'UNH' 'VZ' 'WMT' 'GOOGL' 'AMZN' 'AABA']

In [55]:
df_tech = df[df.Name.isin(['AAPL','GOOGL','MSFT','AMZN'])]

# Pivot dataframe, so that each stock is a column

Turn Date into index to simplify transformations later on

In [56]:
# pivot the dataset while keeping only one price column
pivoted_df = df_tech.pivot(index='Date', columns='Name', values='Close')

# display examples from pivoted dataset
pivoted_df.tail()

Name        AAPL   AMZN  GOOGL  MSFT
Date
9/29/2017 154.12 961.35 973.72 74.49
9/5/2017  162.08 965.27 941.48 73.61
9/6/2017  161.91 967.80 942.02 73.40
9/7/2017  161.26 979.47 949.89 74.34
9/8/2017  158.63 965.90 941.41 73.98

# Prepare data for analysis

###  Use `.shift()` to quickly change the index to leave the first few rows blank

In [57]:
shifted = pivoted_df.shift(7)
shifted.head(10)

Name        AAPL   AMZN  GOOGL  MSFT
Date
1/10/2017    nan    nan    nan   nan
1/11/2017    nan    nan    nan   nan
1/12/2017    nan    nan    nan   nan
1/13/2017    nan    nan    nan   nan
1/17/2017    nan    nan    nan   nan
1/18/2017    nan    nan    nan   nan
1/19/2017    nan    nan    nan   nan
1/20/2017 119.11 795.90 826.01 62.62
1/23/2017 119.75 799.02 829.86 63.19
1/24/2017 119.25 813.64 829.53 62.61

### Calculate returns over 7 days prior as { prices_today/prices_7_days_ago -1.0 }

In [58]:
#calculate returns over 7 days prior
delta_7 = pivoted_df / shifted - 1.0

In [59]:
#display examples
delta_7.head(10)

Name       AAPL  AMZN  GOOGL  MSFT
Date
1/10/2017   nan   nan    nan   nan
1/11/2017   nan   nan    nan   nan
1/12/2017   nan   nan    nan   nan
1/13/2017   nan   nan    nan   nan
1/17/2017   nan   nan    nan   nan
1/18/2017   nan   nan    nan   nan
1/19/2017   nan   nan    nan   nan
1/20/2017  0.01  0.02   0.00  0.00
1/23/2017  0.00  0.02   0.02 -0.00
1/24/2017  0.01  0.01   0.02  0.01

### Melt (unpivot) data to create an analytical base table (ABT)
This should improve performance when running time-series analysis.

In [60]:
# melt with melt()
melted_7 = delta_7.reset_index().melt(id_vars='Date', value_name= 'delta_7')

In [61]:
#melted dataframe example (with 7 days)
melted_7.tail()

           Date  Name  delta_7
999   9/29/2017  MSFT    -0.01
1000   9/5/2017  MSFT    -0.01
1001   9/6/2017  MSFT    -0.01
1002   9/7/2017  MSFT     0.01
1003   9/8/2017  MSFT     0.01

As one can see, the columns name is consolidated in a single column.

### Repeat the shifting and calculation for the 14, 21, 28-day offset
This means comparing today prices with those 14, 21, or 28 days ago.

In [62]:
# calculate returns over each window (offset) and store them in a dictionary with a loop
delta_dict = {}
for offset in [7, 14, 21, 28]:
    delta_dict['delta_{}'.format(offset)] = pivoted_df / pivoted_df.shift(offset) - 1.0

### Repeat the melting process for all other time offsets

In [64]:
# to do so for all the returns dataframes, loop through delta_dic
#melt all the delta dataframes and store in list
melted_dfs = []
for key, delta_df in delta_dict.items():
    melted_dfs.append( delta_df.reset_index().melt(id_vars=['Date'], value_name=key))

### Create a seperate set for the 7-day-forward offset

In [65]:
# calculate 7-day returns after the date
return_df = pivoted_df.shift(-7) / pivoted_df - 1.0

# melt the return dataset and append to list
melted_dfs.append( return_df.reset_index().melt(id_vars=['Date'], value_name='return_7') )

### Use `reduce()` to merge all dataframes (representing intervals) in the dict into one single ABT
`reduce`() is a much faster way to merge dataframes with writing long-winded function for iterating through the list and dictionary.

In [63]:
# create feature_dfs list that contains base features from original dataset plus melted dataset
# grab features from original dataset
base_df = df[['Date','Name', 'Volume', 'Close']]

# create a list with all the features in the  dataframes
feature_dfs = [base_df] + melted_dfs

In [67]:
from functools import reduce

# reduce-merge features into analytical base table
abt = reduce(lambda left,right: pd.merge(left,right,on=['Date','Name']), feature_dfs)

# display examples from the ABT 
abt.head(10)

,Date,Name,Volume,Close,delta_7,delta_14,delta_21,delta_28,return_7
0,1/3/2017,AAPL,"28,781,865.00",116.15,-0.03,nan,nan,nan,0.34
1,1/4/2017,AAPL,"21,118,116.00",116.02,-0.03,-0.03,nan,nan,0.35
2,1/5/2017,AAPL,"22,193,587.00",116.61,-0.04,-0.02,nan,nan,0.37
3,1/6/2017,AAPL,"31,751,900.00",117.91,-0.03,-0.02,nan,nan,0.36
4,1/9/2017,AAPL,"33,561,948.00",118.99,-0.02,-0.01,nan,nan,0.34
5,1/10/2017,AAPL,"24,462,051.00",119.11,nan,nan,nan,nan,0.01
6,1/11/2017,AAPL,"27,588,593.00",119.75,nan,nan,nan,nan,0.00
7,1/12/2017,AAPL,"27,086,220.00",119.25,nan,nan,nan,nan,0.01
8,1/13/2017,AAPL,"26,111,948.00",119.04,nan,nan,nan,nan,0.02
9,1/17/2017,AAPL,"34,439,843.00",120.00,nan,nan,nan,nan,0.02

**Now, we have a ABT ready for analysis using analytics tools such as Tableau**